|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
import pandas as pd

In [4]:
# Read data and describe it
df = pd.read_csv(r'C:\Users\soura\Desktop\dsc_weekday_1\Assignments\titanic_dataset.csv')
df.describe(include='all')

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
count,1309.000000,1309.000000,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308,295,1307,486,121.000000,745
unique,NaN,NaN,NaN,1307,2,NaN,NaN,NaN,929,263,186,3,27,NaN,369
top,NaN,NaN,NaN,"Connolly, Miss. Kate",male,NaN,NaN,NaN,CA. 2343,$8.05,C23 C25 C27,S,13,NaN,"New York, NY"
freq,NaN,NaN,NaN,2,843,NaN,NaN,NaN,11,60,6,914,39,NaN,64
mean,654.000000,2.294882,0.381971,NaN,NaN,29.881135,0.498854,0.385027,NaN,NaN,NaN,NaN,NaN,160.809917,NaN
std,378.020061,0.837836,0.486055,NaN,NaN,14.413500,1.041658,0.865560,NaN,NaN,NaN,NaN,NaN,97.696922,NaN
min,0.000000,1.000000,0.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,1.000000,NaN
25%,327.000000,2.000000,0.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,72.000000,NaN
50%,654.000000,3.000000,0.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,155.000000,NaN
75%,981.000000,3.000000,1.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,NaN,NaN,NaN,NaN,256.000000,NaN
max,1308.000000,3.000000,1.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,NaN,NaN,NaN,NaN,328.000000,NaN

In [5]:
# Find columns with missingdata
df.columns[df.isnull().any()]
df.columns[df.isnull().any()].tolist()

['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest']

In [6]:
# Print shape of dataset
print(df.shape)

(1309, 15)

In [7]:
# drop columns with more than 25% missing data
print(df.count())
perc = len(df) * .75
r = df.dropna(thresh = perc, axis = 1, inplace=True)
# print(r.columns)

Unnamed: 0    1309
pclass        1309
survived      1309
name          1309
gender        1309
age           1046
sibsp         1309
parch         1309
ticket        1309
fare          1308
cabin          295
embarked      1307
boat           486
body           121
home.dest      745
dtype: int64

In [8]:
# drop columns having independent values(which do not affect the survival rate).
df.drop(columns=['Unnamed: 0', 'name'], inplace=True)
print(df.columns)

Index(['pclass', 'survived', 'gender', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'embarked'],
      dtype='object')

In [9]:
# check data types of all columns
df.dtypes

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare         object
embarked     object
dtype: object

In [10]:
# convert price to numeric
df['fare'] = df.fare.str.replace('$' , '')
df.fare = df.fare.astype(float)

In [106]:
df.dtypes

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
embarked     object
dtype: object

In [14]:
# find columns still having missing/na values and also count of missing data
df.columns[df.isnull().any()]
df.isnull().sum()

# Index(['age', 'fare', 'embarked'], dtype='object')

pclass      0
survived    0
gender      0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    0
dtype: int64

In [12]:
# fill na with mean for fare and age column column.
df['age'].fillna((df['age'].mean()),inplace=True ) 
df['fare'].fillna((df['fare'].mean()),inplace=True )

In [13]:
# drop na values for embarked column.
df.dropna(axis=0,inplace=True)

In [15]:
# dump the dataframe to a csv file 'titanic_filtered.csv'.
df.to_csv('titanic_filtered.csv', index = False)

In [16]:
# for surviced column replace 0 with D and 1 with A

df['survived'].replace([0, 1],['D', 'A'], inplace = True)

In [118]:
# find the frequency of different values in survived column
df['survived'].value_counts()

D    809
A    498
Name: survived, dtype: int64

In [17]:
# group by gender and survived and see the counts in each category
df.groupby(by=['gender','survived']).size()

gender  survived
female  A           337
        D           127
male    A           161
        D           682
dtype: int64

In [18]:
# find different pclass and no of people in each class
df.groupby(by=['pclass']).size()

pclass
1    321
2    277
3    709
dtype: int64

In [19]:
# find top 5 people with highest values of age. Count no of male and females in the top 5
df.nlargest(5, ['age'])

      pclass survived  gender   age  sibsp  parch    ticket   fare embarked
14         1        A    male  80.0      0      0     27042  30.00        S
61         1        A  female  76.0      1      0     19877  78.85        S
1235       3        D    male  74.0      0      0    347060   7.78        S
9          1        D    male  71.0      0      0  PC 17609  49.50        C
135        1        D    male  71.0      0      0  PC 17754  34.65        C

In [20]:
df.nlargest(5, ['age']).groupby(by=['gender']).size()

gender
female    1
male      4
dtype: int64

In [21]:
# find max age male and female who survived
df[df['survived'] == 'A'].groupby('gender')['age'].max()

gender
female    76.0
male      80.0
Name: age, dtype: float64

In [22]:
# get average age by gender
df.groupby(by='gender')['age'].mean()

gender
female    28.795931
male      30.430716
Name: age, dtype: float64

In [23]:
# get average age by people survived vs not-survived
df.groupby(by='survived')['age'].mean()

survived
A    28.974711
D    30.389368
Name: age, dtype: float64